# -*- mode: org; coding: utf-8; ispell-local-dictionary: "german8"; -*-
# Time-stamp: <2017-06-17 20:24:50 vk>

** Tables
:PROPERTIES:
:CREATED:  [2014-01-30 Thu 20:14]
:END:

A basic table:

| Season | Sports  |
| Winter | Skiing  |
| Summer | Bathing |

| Season | Light |
|--------+-------|
| Winter | low   |
| Summer | much  |

| *Header1* | *a wide column is here*                                                                      | *Something else* |
|-----------+----------------------------------------------------------------------------------------------+------------------|
| foo bar   | This is a really, really, really, extra wide column as well to show how wide tables are done |               23 |
| Hänsel    | und Gretel                                                                                   |            42.77 |
|-----------+----------------------------------------------------------------------------------------------+------------------|
|           |                                                                                              |            65.77 |
#+TBLFM: @>$3=vsum(@I$3..@II$3)

Complex table:

#+NAME: My-table-name
| *What*               |   *€* | *Amount* |  *Sum* | *Notes*             |
|----------------------+-------+----------+--------+---------------------|
| [[https://roses.example.com/myroses.html][My Roses]]             | 42.23 |       12 | 506.76 | *best* roses ~evar~ |
| [[id:2014-01-27-full-syntax-test][internal *link* test]] |    10 |        2 |     20 | Umlaut test: öÄß    |
#+TBLFM: $4=$2*$3

